# StoryAboveNonStoryLevel Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..LevelFailures..::..StoryAboveNonStoryLevel Property
BuiltInFailures..::..LevelFailures Class See Also
---
The level set as the Story Above for these levels is no longer a story level. This change will cause these levels to revert to the default Story Above.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StoryAboveNonStoryLevel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StoryAboveNonStoryLevel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StoryAboveNonStoryLevel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..LevelFailures Class
Autodesk.Revit.DB Namespace